In [ ]:
import numpy as np

In [ ]:
import pandas as pd

In [ ]:
#help(pd.Series)

In [ ]:
myindex = ['USA','Canada','Mexico']

In [ ]:
mydata = [1776,1867,1821]

In [ ]:
myser = pd.Series(data=mydata,index=myindex)
myser

USA       1776
Canada    1867
Mexico    1821
dtype: int64

In [ ]:
type(myser)

pandas.core.series.Series

In [ ]:
myser[0]

/tmp/ipython-input-8-3030946548.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  myser[0]

np.int64(1776)

In [ ]:
myser["USA"]

np.int64(1776)

In [ ]:
ages = {"Sam":5,"Frank":10,"Spike":7} #dictionary

In [ ]:
pd.Series(ages)

Sam       5
Frank    10
Spike     7
dtype: int64

In [ ]:
# 2 dictionaries
q1 = {'Japan': 80, 'China': 450, 'India': 200, 'USA': 250}
q2 = {'Brazil': 100,'China': 500, 'India': 210,'USA': 260}

In [ ]:
sales_q1 = pd.Series(q1)
sales_q2 = pd.Series(q2)

In [ ]:
sales_q1

Japan     80
China    450
India    200
USA      250
dtype: int64

In [ ]:
sales_q2

Brazil    100
China     500
India     210
USA       260
dtype: int64

In [ ]:
sales_q1["Japan"]

np.int64(80)

In [ ]:
sales_q1[1]

/tmp/ipython-input-17-743046545.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  sales_q1[1]

np.int64(450)

In [ ]:
sales_q1.keys()

Index(['Japan', 'China', 'India', 'USA'], dtype='object')

In [ ]:
sales_q1 * 2

Japan    160
China    900
India    400
USA      500
dtype: int64

In [ ]:
sales_q1

Japan     80
China    450
India    200
USA      250
dtype: int64

In [ ]:
sales_q2

Brazil    100
China     500
India     210
USA       260
dtype: int64

In [ ]:
sales_q1 + sales_q2

Brazil      NaN
China     950.0
India     410.0
Japan       NaN
USA       510.0
dtype: float64

In [ ]:
sales_q1.add(sales_q2,fill_value=0)

Brazil    100.0
China     950.0
India     410.0
Japan      80.0
USA       510.0
dtype: float64

In [ ]:
sales_q1.dtype

dtype('int64')

In [ ]:
first_half = sales_q1.add(sales_q2,fill_value=0)

In [ ]:
first_half.dtype

dtype('float64')